# Напишите программу, которая найдёт произведение 
# пар чисел списка. Парой считаем первый и последний элемент, 
# второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
import math
a = [2, 3, 4, 5, 6]
b = [b for b in range(math.ceil((len(a)/2)))] 
for i in range(math.ceil(len(a)/2)):
    b[i] = a[i] * a[len(a)-i-1]
print(b)
