# Задайте последовательность чисел. Напишите программу, 
# которая выведет список неповторяющихся элементов 
# исходной последовательности.

a = [1, 2, 2, 2, 2, 3, 4, 4, 4, 42]
print(set(a))