# Задайте последовательность чисел. Напишите программу, 
# которая выведет список неповторяющихся элементов 
# исходной последовательности.

a = [1, 2, 2, 2, 2, 3, 4, 4, 4, 42]
print(set(a))
# n = int(input())
# list_num = []
# cur_num = 2
# while n!=1:
#     if n%cur_num==0:
#         list_num.append(cur_num)
#         n = n//cur_num
#         cur_num = 2
#     cur_num +=1
# print(list_num)
